app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    entry = Entry.all